---
kind: method
id: M:Autodesk.Revit.UI.PromptForFamilyInstancePlacementOptions.#ctor
source: html/ca067bdc-f67c-b4a0-800f-0e5a9fa0cbe1.htm
---
# Autodesk.Revit.UI.PromptForFamilyInstancePlacementOptions.#ctor Method

Creates a new PromptForFamilyInstancePlacementOptions using default options.

## Syntax (C#)
```csharp
public PromptForFamilyInstancePlacementOptions()
```